Stock-Portfolio-Backend/app/controllers/login_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "g@g.com"], ["LIMIT", 1]]
---
    def create
        user = User.find_by(email: login_params[:email])