Stock-Portfolio-Backend/app/controllers/transactions_controller.rb

    def show
        user = User.find(params[:user_id])
        if(user.transactions.size != 0)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1  [["user_id", 5]]
SELECT COUNT(*) FROM "transactions" WHERE "transactions"."user_id" = $1  [["user_id", 13]]

    def create
        #verify transaction server side
        transaction_details = Transaction.verify_buy_transaction(transaction_params[:user_id], transaction_params[:stock_id], transaction_params[:quantity])
        if(transaction_details[:new_user_balance] < 0)
            render json:[errors: "An error occured when submitting this transaction."]
        else
            new_trans_params = transaction_params
            new_trans_params[:sale_price] = transaction_details[:sale_price]
            new_trans_params[:sale_total] = transaction_details[:sale_total]
            new_trans_params[:sale_type] = "BUY"
            new_trans = Transaction.create(new_trans_params)
---
INSERT INTO "transactions" ("user_id", "stock_id", "sale_type", "sale_price", "quantity", "sale_total", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"