Stock-Portfolio-Backend/app/controllers/transactions_controller.rb

UPDATE "users" SET "account_balance" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["account_balance", "4898.62"], ["updated_at", "2020-05-07 20:44:44.182320"], ["id", 10]]
---
    def create
        #verify transaction server side
        transaction_details = Transaction.verify_buy_transaction(transaction_params[:user_id], transaction_params[:stock_id], transaction_params[:quantity])
        if(transaction_details[:new_user_balance] < 0)
            render json:[errors: "An error occured when submitting this transaction."]
        else
            new_trans_params = transaction_params
            new_trans_params[:sale_price] = transaction_details[:sale_price]
            new_trans_params[:sale_total] = transaction_details[:sale_total]
            new_trans_params[:sale_type] = "BUY"
            new_trans = Transaction.create(new_trans_params)
            if(new_trans.valid?)
                found_user.update_account_balance(new_trans_params[:sale_total])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
    def found_user
        user = User.find(transaction_params[:user_id])