Stock-Portfolio-Backend/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "name", "password_digest", "account_balance", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        #get new params
        new_user_params = user_params
        new_user_params[:account_balance] = 5000.00
        #create new user
        user = User.create(new_user_params)