Stock-Portfolio-Backend/app/models/stock.rb

SELECT "stocks".* FROM "stocks" WHERE "stocks"."stock_symbol" = $1 LIMIT $2  [["stock_symbol", "AAPL"], ["LIMIT", 1]]
---
    def self.handle_stock(stock_info)
        stock = Stock.find_by(stock_symbol:stock_info["symbol"])

UPDATE "stocks" SET "day_open_price" = $1, "current_price" = $2, "updated_at" = $3 WHERE "stocks"."id" = $4  [["day_open_price", nil], ["current_price", "318.1"], ["updated_at", "2020-05-07 21:37:40.467587"], ["id", 1]]
---
    def self.update_stock_prices(stock, stock_info)
        stock.update(day_open_price:stock_info["open"], current_price:stock_info["iexRealtimePrice"], day_close_price:stock_info["close"])