Stock-Portfolio-Backend/app/models/transaction.rb

  def self.verify_buy_transaction(user_id, stock_id, quantity)
    transaction_details = Hash.new()
    user = User.find(user_id)
    transaction_details[:user_balance] = user.account_balance
    stock = Stock.find(stock_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]