Stock-Portfolio-Backend/app/models/user.rb

    def update_account_balance(sale_total)
        current_balance = self.account_balance
        new_balance = current_balance - sale_total
        self.update(account_balance: new_balance)
---
UPDATE "users" SET "account_balance" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["account_balance", "4898.62"], ["updated_at", "2020-05-07 20:44:44.182320"], ["id", 10]]

    def get_portfolio
        portfolio = Hash.new()
        self.transactions.all.each do |transaction|
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1  [["user_id", 1]]